7767517
228 256
Input            input                    0 1 input
Convolution      Conv_0                   1 1 input 908 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864
Clip             Clip_3                   1 1 908 485 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_4                   1 1 485 911 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
Clip             Clip_7                   1 1 911 490 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_8                   1 1 490 914 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      Conv_9                   1 1 914 917 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1536
Clip             Clip_12                  1 1 917 497 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_13                  1 1 497 920 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Clip             Clip_16                  1 1 920 502 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_17                  1 1 502 923 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
Split            splitncnn_0              1 2 923 923_splitncnn_0 923_splitncnn_1
Convolution      Conv_18                  1 1 923_splitncnn_1 926 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
Clip             Clip_21                  1 1 926 509 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_22                  1 1 509 929 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1296 7=144
Clip             Clip_25                  1 1 929 514 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_26                  1 1 514 932 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
BinaryOp         Add_27                   2 1 923_splitncnn_0 932 517 0=0
Convolution      Conv_28                  1 1 517 935 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
Clip             Clip_31                  1 1 935 522 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_32                  1 1 522 938 0=144 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1296 7=144
Clip             Clip_35                  1 1 938 527 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_36                  1 1 527 941 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
Split            splitncnn_1              1 2 941 941_splitncnn_0 941_splitncnn_1
Convolution      Conv_37                  1 1 941_splitncnn_1 944 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
Clip             Clip_40                  1 1 944 534 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_41                  1 1 534 947 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
Clip             Clip_44                  1 1 947 539 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_45                  1 1 539 950 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         Add_46                   2 1 941_splitncnn_0 950 542 0=0
Split            splitncnn_2              1 2 542 542_splitncnn_0 542_splitncnn_1
Convolution      Conv_47                  1 1 542_splitncnn_1 953 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
Clip             Clip_50                  1 1 953 547 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_51                  1 1 547 956 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
Clip             Clip_54                  1 1 956 552 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_55                  1 1 552 959 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         Add_56                   2 1 542_splitncnn_0 959 555 0=0
Convolution      Conv_57                  1 1 555 962 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
Clip             Clip_60                  1 1 962 560 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_61                  1 1 560 965 0=192 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
Clip             Clip_64                  1 1 965 565 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_65                  1 1 565 968 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12288
Split            splitncnn_3              1 2 968 968_splitncnn_0 968_splitncnn_1
Convolution      Conv_66                  1 1 968_splitncnn_1 971 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_69                  1 1 971 572 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_70                  1 1 572 974 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_73                  1 1 974 577 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_74                  1 1 577 977 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_75                   2 1 968_splitncnn_0 977 580 0=0
Split            splitncnn_4              1 2 580 580_splitncnn_0 580_splitncnn_1
Convolution      Conv_76                  1 1 580_splitncnn_1 980 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_79                  1 1 980 585 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_80                  1 1 585 983 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_83                  1 1 983 590 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_84                  1 1 590 986 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_85                   2 1 580_splitncnn_0 986 593 0=0
Split            splitncnn_5              1 2 593 593_splitncnn_0 593_splitncnn_1
Convolution      Conv_86                  1 1 593_splitncnn_1 989 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_89                  1 1 989 598 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_90                  1 1 598 992 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_93                  1 1 992 603 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_94                  1 1 603 995 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_95                   2 1 593_splitncnn_0 995 606 0=0
Convolution      Conv_96                  1 1 606 998 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_99                  1 1 998 611 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_100                 1 1 611 1001 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_103                 1 1 1001 616 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_104                 1 1 616 1004 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=36864
Split            splitncnn_6              1 2 1004 1004_splitncnn_0 1004_splitncnn_1
Convolution      Conv_105                 1 1 1004_splitncnn_1 1007 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Clip             Clip_108                 1 1 1007 623 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_109                 1 1 623 1010 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
Clip             Clip_112                 1 1 1010 628 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_113                 1 1 628 1013 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
BinaryOp         Add_114                  2 1 1004_splitncnn_0 1013 631 0=0
Split            splitncnn_7              1 2 631 631_splitncnn_0 631_splitncnn_1
Convolution      Conv_115                 1 1 631_splitncnn_1 1016 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Clip             Clip_118                 1 1 1016 636 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_119                 1 1 636 1019 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
Clip             Clip_122                 1 1 1019 641 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_123                 1 1 641 1022 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
BinaryOp         Add_124                  2 1 631_splitncnn_0 1022 644 0=0
Split            splitncnn_8              1 3 644 644_splitncnn_0 644_splitncnn_1 644_splitncnn_2
Convolution      Conv_125                 1 1 644_splitncnn_2 1025 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Clip             Clip_128                 1 1 1025 649 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_129                 1 1 649 1028 0=576 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
Clip             Clip_132                 1 1 1028 654 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_133                 1 1 654 1031 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=92160
Split            splitncnn_9              1 2 1031 1031_splitncnn_0 1031_splitncnn_1
Convolution      Conv_134                 1 1 1031_splitncnn_1 1034 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
Clip             Clip_137                 1 1 1034 661 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_138                 1 1 661 1037 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=8640 7=960
Clip             Clip_141                 1 1 1037 666 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_142                 1 1 666 1040 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
BinaryOp         Add_143                  2 1 1031_splitncnn_0 1040 669 0=0
Split            splitncnn_10             1 2 669 669_splitncnn_0 669_splitncnn_1
Convolution      Conv_144                 1 1 669_splitncnn_1 1043 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
Clip             Clip_147                 1 1 1043 674 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_148                 1 1 674 1046 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=8640 7=960
Clip             Clip_151                 1 1 1046 679 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_152                 1 1 679 1049 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
BinaryOp         Add_153                  2 1 669_splitncnn_0 1049 682 0=0
Convolution      Conv_154                 1 1 682 1052 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
Clip             Clip_157                 1 1 1052 687 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_158                 1 1 687 1055 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=8640 7=960
Clip             Clip_161                 1 1 1055 692 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_162                 1 1 692 1058 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=307200
Convolution      Conv_163                 1 1 1058 1061 0=1280 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=409600
Clip             Clip_166                 1 1 1061 699 0=0.000000e+00 1=6.000000e+00
Split            splitncnn_11             1 3 699 699_splitncnn_0 699_splitncnn_1 699_splitncnn_2
Convolution      Conv_167                 1 1 699_splitncnn_2 1064 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=327680
Clip             Clip_170                 1 1 1064 704 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_171                 1 1 704 1067 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
Clip             Clip_174                 1 1 1067 709 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_175                 1 1 709 1070 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
Clip             Clip_178                 1 1 1070 714 0=0.000000e+00 1=6.000000e+00
Split            splitncnn_12             1 3 714 714_splitncnn_0 714_splitncnn_1 714_splitncnn_2
Convolution      Conv_179                 1 1 714_splitncnn_2 1073 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
Clip             Clip_182                 1 1 1073 719 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_183                 1 1 719 1076 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
Clip             Clip_186                 1 1 1076 724 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_187                 1 1 724 1079 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
Clip             Clip_190                 1 1 1079 729 0=0.000000e+00 1=6.000000e+00
Split            splitncnn_13             1 3 729 729_splitncnn_0 729_splitncnn_1 729_splitncnn_2
Convolution      Conv_191                 1 1 729_splitncnn_2 1082 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
Clip             Clip_194                 1 1 1082 734 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_195                 1 1 734 1085 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
Clip             Clip_198                 1 1 1085 739 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_199                 1 1 739 1088 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
Clip             Clip_202                 1 1 1088 744 0=0.000000e+00 1=6.000000e+00
Split            splitncnn_14             1 3 744 744_splitncnn_0 744_splitncnn_1 744_splitncnn_2
Convolution      Conv_203                 1 1 744_splitncnn_2 1091 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Clip             Clip_206                 1 1 1091 749 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_207                 1 1 749 1094 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
Clip             Clip_210                 1 1 1094 754 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_211                 1 1 754 1097 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
Clip             Clip_214                 1 1 1097 759 0=0.000000e+00 1=6.000000e+00
Split            splitncnn_15             1 2 759 759_splitncnn_0 759_splitncnn_1
ConvolutionDepthWise Conv_215                 1 1 644_splitncnn_1 1100 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Clip             Clip_218                 1 1 1100 764 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_219                 1 1 764 765 0=486 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=46656
Split            splitncnn_16             1 2 765 765_splitncnn_0 765_splitncnn_1
ConvolutionDepthWise Conv_220                 1 1 644_splitncnn_0 1103 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Clip             Clip_223                 1 1 1103 770 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_224                 1 1 770 771 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ConvolutionDepthWise Conv_225                 1 1 699_splitncnn_1 1106 0=1280 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=11520 7=1280
Clip             Clip_228                 1 1 1106 776 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_229                 1 1 776 777 0=486 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=622080
Split            splitncnn_17             1 2 777 777_splitncnn_0 777_splitncnn_1
ConvolutionDepthWise Conv_230                 1 1 699_splitncnn_0 1109 0=1280 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=11520 7=1280
Clip             Clip_233                 1 1 1109 782 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_234                 1 1 782 783 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=30720
ConvolutionDepthWise Conv_235                 1 1 714_splitncnn_1 1112 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
Clip             Clip_238                 1 1 1112 788 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_239                 1 1 788 789 0=486 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=248832
Split            splitncnn_18             1 2 789 789_splitncnn_0 789_splitncnn_1
ConvolutionDepthWise Conv_240                 1 1 714_splitncnn_0 1115 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
Clip             Clip_243                 1 1 1115 794 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_244                 1 1 794 795 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12288
ConvolutionDepthWise Conv_245                 1 1 729_splitncnn_1 1118 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
Clip             Clip_248                 1 1 1118 800 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_249                 1 1 800 801 0=486 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=124416
Split            splitncnn_19             1 2 801 801_splitncnn_0 801_splitncnn_1
ConvolutionDepthWise Conv_250                 1 1 729_splitncnn_0 1121 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
Clip             Clip_253                 1 1 1121 806 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_254                 1 1 806 807 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
ConvolutionDepthWise Conv_255                 1 1 744_splitncnn_1 1124 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
Clip             Clip_258                 1 1 1124 812 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_259                 1 1 812 813 0=486 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=124416
Split            splitncnn_20             1 2 813 813_splitncnn_0 813_splitncnn_1
ConvolutionDepthWise Conv_260                 1 1 744_splitncnn_0 1127 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
Clip             Clip_263                 1 1 1127 818 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_264                 1 1 818 819 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
ConvolutionDepthWise Conv_265                 1 1 759_splitncnn_1 1130 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
Clip             Clip_268                 1 1 1130 824 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_269                 1 1 824 825 0=486 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=62208
Split            splitncnn_21             1 2 825 825_splitncnn_0 825_splitncnn_1
ConvolutionDepthWise Conv_270                 1 1 759_splitncnn_0 1133 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
Clip             Clip_273                 1 1 1133 830 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_274                 1 1 830 831 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
PriorBox         PriorBox_275             1 1 765_splitncnn_1 832 -23300=1,48.000000 -23301=1,100.000000 -23302=2,2.000000,3.000000 9=320 10=320 11=16.000000 12=16.000000 13=0.500000 14=1
Reshape          Reshape_277              1 1 832 834 0=-1 1=2
PriorBox         PriorBox_278             1 1 777_splitncnn_1 835 -23300=1,100.000000 -23301=1,150.000000 -23302=2,2.000000,3.000000 9=320 10=320 11=32.000000 12=32.000000 13=0.500000 14=1
Reshape          Reshape_280              1 1 835 837 0=-1 1=2
PriorBox         PriorBox_281             1 1 789_splitncnn_1 838 -23300=1,150.000000 -23301=1,202.000000 -23302=2,2.000000,3.000000 9=320 10=320 11=64.000000 12=64.000000 13=0.500000 14=1
Reshape          Reshape_283              1 1 838 840 0=-1 1=2
PriorBox         PriorBox_284             1 1 801_splitncnn_1 841 -23300=1,202.000000 -23301=1,253.000000 -23302=2,2.000000,3.000000 9=320 10=320 11=107.000000 12=107.000000 13=0.500000 14=1
Reshape          Reshape_286              1 1 841 843 0=-1 1=2
PriorBox         PriorBox_287             1 1 813_splitncnn_1 844 -23300=1,253.000000 -23301=1,304.000000 -23302=2,2.000000,3.000000 9=320 10=320 11=160.000000 12=160.000000 13=0.500000 14=1
Reshape          Reshape_289              1 1 844 846 0=-1 1=2
PriorBox         PriorBox_290             1 1 825_splitncnn_1 847 -23300=1,304.000000 -23301=1,320.000000 -23302=2,2.000000,3.000000 9=320 10=320 11=320.000000 12=320.000000 13=0.500000 14=1
Reshape          Reshape_292              1 1 847 849 0=-1 1=2
Permute          Transpose_293            1 1 765_splitncnn_0 850 0=3
Reshape          Reshape_295              1 1 850 852 0=81 1=-1
Permute          Transpose_296            1 1 771 853 0=3
Reshape          Reshape_298              1 1 853 855 0=4 1=-1
Permute          Transpose_299            1 1 777_splitncnn_0 856 0=3
Reshape          Reshape_301              1 1 856 858 0=81 1=-1
Permute          Transpose_302            1 1 783 859 0=3
Reshape          Reshape_304              1 1 859 861 0=4 1=-1
Permute          Transpose_305            1 1 789_splitncnn_0 862 0=3
Reshape          Reshape_307              1 1 862 864 0=81 1=-1
Permute          Transpose_308            1 1 795 865 0=3
Reshape          Reshape_310              1 1 865 867 0=4 1=-1
Permute          Transpose_311            1 1 801_splitncnn_0 868 0=3
Reshape          Reshape_313              1 1 868 870 0=81 1=-1
Permute          Transpose_314            1 1 807 871 0=3
Reshape          Reshape_316              1 1 871 873 0=4 1=-1
Permute          Transpose_317            1 1 813_splitncnn_0 874 0=3
Reshape          Reshape_319              1 1 874 876 0=81 1=-1
Permute          Transpose_320            1 1 819 877 0=3
Reshape          Reshape_322              1 1 877 879 0=4 1=-1
Permute          Transpose_323            1 1 825_splitncnn_0 880 0=3
Reshape          Reshape_325              1 1 880 882 0=81 1=-1
Permute          Transpose_326            1 1 831 883 0=3
Reshape          Reshape_328              1 1 883 885 0=4 1=-1
Concat           Concat_329               6 1 855 861 867 873 879 885 886 0=0
Concat           Concat_330               6 1 852 858 864 870 876 882 887 0=0
Softmax          Softmax_331              1 1 887 888 0=1 1=1
Split            splitncnn_22             1 2 888 888_splitncnn_0 888_splitncnn_1
Concat           Concat_332               6 1 834 837 840 843 846 849 889 0=1
Crop             Slice_337                1 1 888_splitncnn_1 894 -23309=1,80 -23310=1,2147483647 -23311=1,1
Crop             Slice_342                1 1 888_splitncnn_0 899 -23309=1,0 -23310=1,80 -23311=1,1
Concat           Concat_343               2 1 894 899 900 0=1
Reshape          Reshape_345              1 1 886 902 0=-1 1=1
Reshape          Reshape_347              1 1 900 904 0=-1 1=1
Reshape          Reshape_349              1 1 889 906 0=-1 1=2
DetectionOutput  DetectionOutput_350      3 1 902 904 906 detection_output 0=81 1=0.450000 2=5000 3=200 4=0.020000 5=0.100000 6=0.100000 7=0.200000 8=0.200000
