7767517
158 172
Input            input                    0 1 input
Convolution      Conv_0                   1 1 input 661 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864
ReLU             LeakyRelu_1              1 1 661 441 0=1.000000e-01
ConvolutionDepthWise Conv_2                   1 1 441 664 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             LeakyRelu_3              1 1 664 444 0=1.000000e-01
Convolution      Conv_4                   1 1 444 667 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      Conv_5                   1 1 667 670 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1536
ReLU             LeakyRelu_6              1 1 670 449 0=1.000000e-01
ConvolutionDepthWise Conv_7                   1 1 449 673 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864 7=96
ReLU             LeakyRelu_8              1 1 673 452 0=1.000000e-01
Convolution      Conv_9                   1 1 452 676 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
Split            splitncnn_0              1 2 676 676_splitncnn_0 676_splitncnn_1
Convolution      Conv_10                  1 1 676_splitncnn_1 679 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
ReLU             LeakyRelu_11             1 1 679 457 0=1.000000e-01
ConvolutionDepthWise Conv_12                  1 1 457 682 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1296 7=144
ReLU             LeakyRelu_13             1 1 682 460 0=1.000000e-01
Convolution      Conv_14                  1 1 460 685 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
BinaryOp         Add_15                   2 1 676_splitncnn_0 685 463 0=0
Convolution      Conv_16                  1 1 463 688 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
ReLU             LeakyRelu_17             1 1 688 466 0=1.000000e-01
ConvolutionDepthWise Conv_18                  1 1 466 691 0=144 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1296 7=144
ReLU             LeakyRelu_19             1 1 691 469 0=1.000000e-01
Convolution      Conv_20                  1 1 469 694 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
Split            splitncnn_1              1 2 694 694_splitncnn_0 694_splitncnn_1
Convolution      Conv_21                  1 1 694_splitncnn_1 697 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
ReLU             LeakyRelu_22             1 1 697 474 0=1.000000e-01
ConvolutionDepthWise Conv_23                  1 1 474 700 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
ReLU             LeakyRelu_24             1 1 700 477 0=1.000000e-01
Convolution      Conv_25                  1 1 477 703 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         Add_26                   2 1 694_splitncnn_0 703 480 0=0
Split            splitncnn_2              1 2 480 480_splitncnn_0 480_splitncnn_1
Convolution      Conv_27                  1 1 480_splitncnn_1 706 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
ReLU             LeakyRelu_28             1 1 706 483 0=1.000000e-01
ConvolutionDepthWise Conv_29                  1 1 483 709 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
ReLU             LeakyRelu_30             1 1 709 486 0=1.000000e-01
Convolution      Conv_31                  1 1 486 712 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         Add_32                   2 1 480_splitncnn_0 712 489 0=0
Split            splitncnn_3              1 2 489 489_splitncnn_0 489_splitncnn_1
Convolution      Conv_33                  1 1 489_splitncnn_1 715 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
ReLU             LeakyRelu_34             1 1 715 492 0=1.000000e-01
ConvolutionDepthWise Conv_35                  1 1 492 718 0=192 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
ReLU             LeakyRelu_36             1 1 718 495 0=1.000000e-01
Convolution      Conv_37                  1 1 495 721 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12288
Split            splitncnn_4              1 2 721 721_splitncnn_0 721_splitncnn_1
Convolution      Conv_38                  1 1 721_splitncnn_1 724 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
ReLU             LeakyRelu_39             1 1 724 500 0=1.000000e-01
ConvolutionDepthWise Conv_40                  1 1 500 727 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
ReLU             LeakyRelu_41             1 1 727 503 0=1.000000e-01
Convolution      Conv_42                  1 1 503 730 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_43                   2 1 721_splitncnn_0 730 506 0=0
Split            splitncnn_5              1 2 506 506_splitncnn_0 506_splitncnn_1
Convolution      Conv_44                  1 1 506_splitncnn_1 733 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
ReLU             LeakyRelu_45             1 1 733 509 0=1.000000e-01
ConvolutionDepthWise Conv_46                  1 1 509 736 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
ReLU             LeakyRelu_47             1 1 736 512 0=1.000000e-01
Convolution      Conv_48                  1 1 512 739 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_49                   2 1 506_splitncnn_0 739 515 0=0
Split            splitncnn_6              1 2 515 515_splitncnn_0 515_splitncnn_1
Convolution      Conv_50                  1 1 515_splitncnn_1 742 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
ReLU             LeakyRelu_51             1 1 742 518 0=1.000000e-01
ConvolutionDepthWise Conv_52                  1 1 518 745 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
ReLU             LeakyRelu_53             1 1 745 521 0=1.000000e-01
Convolution      Conv_54                  1 1 521 748 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_55                   2 1 515_splitncnn_0 748 524 0=0
Convolution      Conv_56                  1 1 524 751 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
ReLU             LeakyRelu_57             1 1 751 527 0=1.000000e-01
ConvolutionDepthWise Conv_58                  1 1 527 754 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
ReLU             LeakyRelu_59             1 1 754 530 0=1.000000e-01
Convolution      Conv_60                  1 1 530 757 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=36864
Split            splitncnn_7              1 2 757 757_splitncnn_0 757_splitncnn_1
Convolution      Conv_61                  1 1 757_splitncnn_1 760 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
ReLU             LeakyRelu_62             1 1 760 535 0=1.000000e-01
ConvolutionDepthWise Conv_63                  1 1 535 763 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
ReLU             LeakyRelu_64             1 1 763 538 0=1.000000e-01
Convolution      Conv_65                  1 1 538 766 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
BinaryOp         Add_66                   2 1 757_splitncnn_0 766 541 0=0
Split            splitncnn_8              1 2 541 541_splitncnn_0 541_splitncnn_1
Convolution      Conv_67                  1 1 541_splitncnn_1 769 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
ReLU             LeakyRelu_68             1 1 769 544 0=1.000000e-01
ConvolutionDepthWise Conv_69                  1 1 544 772 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
ReLU             LeakyRelu_70             1 1 772 547 0=1.000000e-01
Convolution      Conv_71                  1 1 547 775 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
BinaryOp         Add_72                   2 1 541_splitncnn_0 775 550 0=0
Split            splitncnn_9              1 2 550 550_splitncnn_0 550_splitncnn_1
Convolution      Conv_73                  1 1 550_splitncnn_1 778 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
ReLU             LeakyRelu_74             1 1 778 553 0=1.000000e-01
ConvolutionDepthWise Conv_75                  1 1 553 781 0=576 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
ReLU             LeakyRelu_76             1 1 781 556 0=1.000000e-01
Convolution      Conv_77                  1 1 556 784 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=92160
Split            splitncnn_10             1 2 784 784_splitncnn_0 784_splitncnn_1
Convolution      Conv_78                  1 1 784_splitncnn_1 787 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
ReLU             LeakyRelu_79             1 1 787 561 0=1.000000e-01
ConvolutionDepthWise Conv_80                  1 1 561 790 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=8640 7=960
ReLU             LeakyRelu_81             1 1 790 564 0=1.000000e-01
Convolution      Conv_82                  1 1 564 793 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
BinaryOp         Add_83                   2 1 784_splitncnn_0 793 567 0=0
Split            splitncnn_11             1 2 567 567_splitncnn_0 567_splitncnn_1
Convolution      Conv_84                  1 1 567_splitncnn_1 796 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
ReLU             LeakyRelu_85             1 1 796 570 0=1.000000e-01
ConvolutionDepthWise Conv_86                  1 1 570 799 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=8640 7=960
ReLU             LeakyRelu_87             1 1 799 573 0=1.000000e-01
Convolution      Conv_88                  1 1 573 802 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
BinaryOp         Add_89                   2 1 567_splitncnn_0 802 576 0=0
Convolution      Conv_90                  1 1 576 805 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
ReLU             LeakyRelu_91             1 1 805 579 0=1.000000e-01
ConvolutionDepthWise Conv_92                  1 1 579 808 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=8640 7=960
ReLU             LeakyRelu_93             1 1 808 582 0=1.000000e-01
Convolution      Conv_94                  1 1 582 811 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=307200
Convolution      Conv_95                  1 1 811 814 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=30720
ReLU             LeakyRelu_96             1 1 814 587 0=1.000000e-01
Convolution      Conv_97                  1 1 587 817 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=165888
ReLU             LeakyRelu_98             1 1 817 590 0=1.000000e-01
Convolution      Conv_99                  1 1 590 820 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=18432
ReLU             LeakyRelu_100            1 1 820 593 0=1.000000e-01
Convolution      Conv_101                 1 1 593 823 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=165888
ReLU             LeakyRelu_102            1 1 823 596 0=1.000000e-01
Convolution      Conv_103                 1 1 596 826 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=18432
ReLU             LeakyRelu_104            1 1 826 599 0=1.000000e-01
Split            splitncnn_12             1 2 599 599_splitncnn_0 599_splitncnn_1
Convolution      Conv_105                 1 1 599_splitncnn_1 829 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             LeakyRelu_106            1 1 829 602 0=1.000000e-01
Interp           Resize_108               1 1 602 607 0=1 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Concat           Concat_109               2 1 607 550_splitncnn_0 608 0=0
Convolution      Conv_110                 1 1 608 832 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=18432
ReLU             LeakyRelu_111            1 1 832 611 0=1.000000e-01
Convolution      Conv_112                 1 1 611 835 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=165888
ReLU             LeakyRelu_113            1 1 835 614 0=1.000000e-01
Convolution      Conv_114                 1 1 614 838 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=18432
ReLU             LeakyRelu_115            1 1 838 617 0=1.000000e-01
Convolution      Conv_116                 1 1 617 841 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=165888
ReLU             LeakyRelu_117            1 1 841 620 0=1.000000e-01
Convolution      Conv_118                 1 1 620 844 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=18432
ReLU             LeakyRelu_119            1 1 844 623 0=1.000000e-01
Split            splitncnn_13             1 2 623 623_splitncnn_0 623_splitncnn_1
Convolution      Conv_120                 1 1 623_splitncnn_1 847 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             LeakyRelu_121            1 1 847 626 0=1.000000e-01
Interp           Resize_123               1 1 626 631 0=1 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Concat           Concat_124               2 1 631 489_splitncnn_0 632 0=0
Convolution      Conv_125                 1 1 632 850 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12288
ReLU             LeakyRelu_126            1 1 850 635 0=1.000000e-01
Convolution      Conv_127                 1 1 635 853 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=165888
ReLU             LeakyRelu_128            1 1 853 638 0=1.000000e-01
Convolution      Conv_129                 1 1 638 856 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=18432
ReLU             LeakyRelu_130            1 1 856 641 0=1.000000e-01
Convolution      Conv_131                 1 1 641 859 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=165888
ReLU             LeakyRelu_132            1 1 859 644 0=1.000000e-01
Convolution      Conv_133                 1 1 644 862 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=18432
ReLU             LeakyRelu_134            1 1 862 647 0=1.000000e-01
Convolution      Conv_135                 1 1 599_splitncnn_0 865 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             LeakyRelu_136            1 1 865 650 0=1.000000e-01
Convolution      Conv_137                 1 1 650 651 0=255 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24480
Convolution      Conv_138                 1 1 623_splitncnn_0 868 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             LeakyRelu_139            1 1 868 654 0=1.000000e-01
Convolution      Conv_140                 1 1 654 655 0=255 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24480
Convolution      Conv_141                 1 1 647 871 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             LeakyRelu_142            1 1 871 658 0=1.000000e-01
Convolution      Conv_143                 1 1 658 659 0=255 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24480
Yolov3DetectionOutput Yolov3DetectionOutput_144 3 1 651 655 659 detection_output 0=80 1=3 2=5.000000e-03 3=4.500000e-01 -23304=18,2.200000e+02,1.250000e+02,1.280000e+02,2.220000e+02,2.640000e+02,2.660000e+02,3.500000e+01,8.700000e+01,1.020000e+02,9.600000e+01,6.000000e+01,1.700000e+02,1.000000e+01,1.500000e+01,2.400000e+01,3.600000e+01,7.200000e+01,4.200000e+01 -23305=9,0.000000e+00,1.000000e+00,2.000000e+00,3.000000e+00,4.000000e+00,5.000000e+00,6.000000e+00,7.000000e+00,8.000000e+00 -23306=3,3.200000e+01,1.600000e+01,8.000000e+00
